Revit 2026 API

# ElementTransformUtilsMirrorElements Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<ElementId> MirrorElements(
	Document document,
	ICollection<ElementId> elementsToMirror,
	Plane plane,
	bool mirrorCopies
)
```
```vb
Public Shared Function MirrorElements (
	document As Document,
	elementsToMirror As ICollection(Of ElementId),
	plane As Plane,
	mirrorCopies As Boolean
) As IList(Of ElementId)
```
```cpp
public:
static IList<ElementId^>^ MirrorElements(
	Document^ document,
	ICollection<ElementId^>^ elementsToMirror,
	Plane^ plane,
	bool mirrorCopies
)
```
```fsharp
static member MirrorElements :
        document : Document *
        elementsToMirror : ICollection<ElementId> *
        plane : Plane *
        mirrorCopies : bool -> IList<ElementId>
```

#### Parameters

document Document

elementsToMirror ICollectionElementId

plane Plane

mirrorCopies Boolean

#### Return Value

IListElementId

#### Reference

ElementTransformUtils Class

Autodesk.Revit.DB Namespace